import React from "react";
import ReactEcharts from "echarts-for-react";

const BarChart_lastest = ({ adaptablility = 0 }) => {
  let color_body;

  if (adaptablility < 10) {
    color_body = "#c42e08";
  } else if (adaptablility >= 10 && adaptablility < 30) {
    color_body = "#c46f08";
  } else if (adaptablility >= 30 && adaptablility < 50) {
    color_body = "#c4a808";
  } else if (adaptablility >= 50 && adaptablility < 70) {
    color_body = "#b4c408";
  } else if (adaptablility >= 70 && adaptablility < 80) {
    color_body = "#92c408";
  } else if (adaptablility >= 80 && adaptablility < 90) {
    color_body = "#69c408";
  } else if (adaptablility >= 90 && adaptablility <= 100) {
    color_body = "#08c424";
  }

  const symbols = [
    "path://M 177.29 218.48 c -1.33 -1.52 -3.43 -7.81 -4.76 -10.29 s -2.19 -4.38 -4.57 -6 s -3.34 -2.66 -5.91 -7.9 s -3.52 -15.81 -4.38 -19.81 a 136.39 136.39 0 0 0 -4.19 -19.81 c -1.24 -4.67 -5.91 -14.19 -6.29 -15.91 a 108 108 0 0 1 -2 -16.38 c -0.05 -4 -1.5 -7.9 -1.88 -14.19 c -0.2 -3.23 0.07 -7.81 0.07 -11.81 C 144 83.05 139.51 76 135.7 72.57 s -4.57 -5.33 -15 -6.35 s -16 -5.58 -18.92 -8.63 s -3.18 -16.06 -0.89 -18.54 s 5.2 -4.57 6.79 -14.6 s -1.65 -15.88 -4.44 -19.69 S 90.8 0 89.47 0 C 87.88 0 77.66 1.53 74.86 5.34 S 68.83 15 70.42 25 s 4.51 12.13 6.79 14.6 s 2 15.49 -0.89 18.54 s -8.5 7.62 -18.92 8.64 s -11.17 2.92 -15 6.35 S 34.16 83.62 34.74 97 c 0 4 0.12 8.5 0.12 11.74 S 32.45 117 32.93 123 s -1.62 14.66 -2 16.38 s -5.05 11.23 -6.29 15.9 a 136.39 136.39 0 0 0 -4.19 19.81 c -0.86 4 -1.81 14.57 -4.38 19.81 s -3.52 6.29 -5.91 7.9 s -3.23 3.53 -4.57 6 S 2.16 217.53 0.83 219.05 S 0 222 0.83 222 s 3.18 -1.66 6 -6.09 c 1.33 -2.08 2.19 -1.72 2.29 -1.24 a 12.84 12.84 0 0 1 -0.26 3.55 c -0.28 1.29 -4.86 13.39 -5.14 15.34 c -0.13 0.92 0.07 1.9 1 1.82 c 1.22 -0.11 5.32 -9.24 5.76 -10.19 s 1.2 -1.25 1.19 -0.81 c 0 0.63 -0.49 13.91 -0.11 15.56 c 0.25 1 1.61 1.24 2.21 -1.46 c 0.52 -2.38 2.43 -14.48 3.34 -14.6 s 0.94 2 1.27 5.08 s 0 8.9 0.8 10.14 c 0.56 0.9 1.71 1.32 2 -0.44 s 0.87 -15.25 1.29 -15.36 c 0.73 -0.19 1.23 2 1.49 3.31 c 0.3 1.47 0.69 9 2.45 8.95 c 1 0 1.23 -1.24 1.23 -3 c 0 -0.74 -0.06 -12.74 -0.06 -16.31 s -1.52 -8.7 -0.76 -12.32 c 0.58 -2.74 9.08 -20.7 12.51 -26.79 S 48.26 163.62 47.5 156 s 1.9 -15 3 -19.43 s 3.23 -3 3.61 -0.19 s 2.48 38.67 1.53 42.67 S 49.21 190.48 48.45 201 s -5.9 51.61 5.14 74.85 c 2.86 5.34 2.67 9.91 3.24 19.43 s -0.95 20.19 -2.28 28.95 s 1.14 24.57 5.33 34.48 s 7.05 12.95 6.67 21.33 c 0.38 4.13 0.76 7.69 0.5 9.59 s -1.27 6.86 -2.79 9.4 s -3.81 7.23 0.13 8.5 s 20.06 0 20.06 0 a 2.83 2.83 0 0 0 1.27 -4.19 c -1.52 -3 -3.43 -10.41 -3.43 -12.69 s -3.3 -16.77 -3.55 -25.53 a 269 269 0 0 1 1 -29.71 c 0.76 -6.61 0.38 -7.11 -1.14 -13.34 s -2.16 -1.39 -0.13 -13.07 S 81.4 285.72 82 278.29 s 5.72 -48 6.67 -48.76 c 0.43 -0.35 0.88 0.13 1.24 0.75 c 1.52 7.14 5.75 40.74 6.27 47.44 c 0.57 7.43 1.46 19 3.49 30.66 s 1.39 6.86 -0.13 13.08 s -1.9 6.73 -1.14 13.34 a 269 269 0 0 1 1 29.71 c -0.25 8.76 -3.55 23.24 -3.55 25.52 s -1.91 9.66 -3.43 12.7 a 2.83 2.83 0 0 0 1.27 4.19 s 16.13 1.27 20.06 0 s 1.65 -6 0.13 -8.5 s -2.54 -7.5 -2.79 -9.4 s 0.12 -5.46 0.5 -9.59 c -0.38 -8.38 2.48 -11.43 6.67 -21.33 s 6.67 -25.72 5.33 -34.48 s -2.85 -19.43 -2.28 -28.95 s 0.38 -14.1 3.24 -19.43 c 11 -23.24 5.9 -64.38 5.14 -74.86 s -6.29 -17.9 -7.24 -21.9 s 1.14 -39.81 1.53 -42.67 s 2.47 -4.19 3.61 0.19 s 3.81 11.81 3.05 19.43 s 4.76 15 8.19 21.14 s 11.93 24.06 12.51 26.8 c 0.76 3.62 -0.76 8.63 -0.76 12.32 s -0.07 15.57 -0.07 16.31 c 0 1.75 0.26 3 1.24 3 c 1.76 0 2.15 -7.48 2.45 -9 c 0.26 -1.28 0.76 -3.49 1.49 -3.3 c 0.42 0.11 1 13.67 1.29 15.36 s 1.45 1.34 2 0.44 c 0.76 -1.24 0.46 -7.05 0.79 -10.15 s 0.35 -5.2 1.27 -5.08 s 2.83 12.23 3.35 14.61 c 0.6 2.7 2 2.47 2.21 1.46 c 0.38 -1.65 -0.1 -14.93 -0.11 -15.56 c 0 -0.44 0.68 -0.28 1.19 0.81 s 4.54 10.08 5.76 10.19 c 0.89 0.08 1.1 -0.9 1 -1.82 c -0.28 -2 -4.86 -14.05 -5.14 -15.34 a 12.86 12.86 0 0 1 -0.26 -3.55 c 0.1 -0.48 1 -0.84 2.29 1.24 c 2.82 4.42 5.14 6.09 6 6.09 S 178.62 220 177.29 218.48 Z",
  ];
  const bodyMax = 100;
  const labelSetting = {
    show: true,
    position: "top",
    offset: [0, -20],
    formatter: function (param) {
      return ((param.value / bodyMax) * 100).toFixed(0);
    },
    fontSize: 18,
  };
  const markLineSetting = {
    symbol: "none",
    lineStyle: {
      opacity: 0.3,
    },
    data: [
      {
        type: "max",
        label: {
          formatter: "max: {c}",
        },
      },
      {
        type: "min",
        label: {
          formatter: "min: {c}",
        },
      },
    ],
  };
  let option = {
    tooltip: {},
    title: {
      text: "복무적응도",
      left: "center",
    },
    xAxis: {
      data: ["점수"],
      axisTick: { show: false },
      axisLine: { show: false },
      axisLabel: { show: false },
    },
    yAxis: {
      max: bodyMax,
      offset: 20,
      splitLine: { show: false },
    },
    grid: {
      top: "center",
      height: "70%",
      width: "60%",
      left: "center",
    },
    markLine: {
      z: -100,
    },
    series: [
      {
        name: "복무적응도",
        type: "pictorialBar",
        symbolClip: true,
        symbolBoundingData: bodyMax,
        label: labelSetting,
        data: [
          {
            value: adaptablility,
            symbol: symbols[0],
            itemStyle: {
              color: color_body,
            },
          },
        ],
        markLine: markLineSetting,
        z: 10,
      },

      {
        name: "복무적응도",
        type: "pictorialBar",
        symbolBoundingData: bodyMax,
        animationDuration: 0,
        itemStyle: {
          color: "#ccc",
        },
        data: [
          {
            value: 0,
            symbol: symbols[0],
          },
        ],
      },
    ],
  };
  return (
    <ReactEcharts option={option} style={{ height: "40em", width: "30em" }} />
  );
};

export default BarChart_lastest;
